-- --------------------------------------------------------
-- Хост:                         127.0.0.1
-- Версия сервера:               5.5.23 - MySQL Community Server (GPL)
-- Операционная система:         Win64
-- HeidiSQL Версия:              9.5.0.5196
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;

-- Дамп структуры для таблица kohana.currency
CREATE TABLE IF NOT EXISTS `currency` (
  `id` varchar(50) COLLATE utf8_bin NOT NULL,
  `name` varchar(120) COLLATE utf8_bin DEFAULT '0',
  `rate` float DEFAULT '0',
  UNIQUE KEY `Индекс 1` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- Дамп данных таблицы kohana.currency: ~34 rows (приблизительно)
/*!40000 ALTER TABLE `currency` DISABLE KEYS */;
INSERT INTO `currency` (`id`, `name`, `rate`) VALUES
	('R01010', 'Австралийский доллар', 44.17),
	('R01020A', 'Азербайджанский манат', 37.025),
	('R01035', 'Фунт стерлингов Соединенного королевства', 78.2963),
	('R01060', 'Армянских драмов', 13.1821),
	('R01090B', 'Белорусский рубль', 30.9423),
	('R01100', 'Болгарский лев', 36.1077),
	('R01115', 'Бразильский реал', 16.7269),
	('R01135', 'Венгерских форинтов', 21.7165),
	('R01200', 'Гонконгских долларов', 80.3583),
	('R01215', 'Датских крон', 94.5707),
	('R01235', 'Доллар США', 62.8129),
	('R01239', 'Евро', 70.6771),
	('R01270', 'Индийских рупий', 91.4673),
	('R01335', 'Казахстанских тенге', 16.4034),
	('R01350', 'Канадский доллар', 48.1141),
	('R01370', 'Киргизских сомов', 90.2484),
	('R01375', 'Китайских юаней', 91.339),
	('R01500', 'Молдавских леев', 35.5226),
	('R01535', 'Норвежских крон', 73.4576),
	('R01565', 'Польский злотый', 16.5869),
	('R01585F', 'Румынский лей', 14.921),
	('R01589', 'СДР (специальные права заимствования)', 86.9795),
	('R01625', 'Сингапурский доллар', 46.2881),
	('R01670', 'Таджикских сомони', 66.6097),
	('R01700J', 'Турецкая лира', 10.9772),
	('R01710A', 'Новый туркменский манат', 17.9722),
	('R01717', 'Узбекских сумов', 73.1917),
	('R01720', 'Украинских гривен', 24.2602),
	('R01760', 'Чешских крон', 27.6052),
	('R01770', 'Шведских крон', 67.0884),
	('R01775', 'Швейцарский франк', 63.8083),
	('R01810', 'Южноафриканских рэндов', 45.2386),
	('R01815', 'Вон Республики Корея', 53.3097),
	('R01820', 'Японских иен', 58.1413);
/*!40000 ALTER TABLE `currency` ENABLE KEYS */;

/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IF(@OLD_FOREIGN_KEY_CHECKS IS NULL, 1, @OLD_FOREIGN_KEY_CHECKS) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
